In [11]:
# !pip install pymysql

In [1]:
import pymysql

In [2]:
# création d'un connexion object
conn = pymysql.connect(host="localhost", port=3306, user="user_name", password="pwd", db="sys")

#### ATTENTION ! Si on rencontre des problèmes lors de la création de l'objet "conn", il faut créer un nouveau superutilisateur dans la console. 
1. sudo mysql -u root -p
2. on entre le mdp de sudo
3. on entre le mdp de mysql
4. on est alors connecté à mysql dans la console
5. on crée un nouveau user :
    CREATE USER 'nom_user'@'localhost' IDENTIFIED BY 'mdp_user';
6. On lui attribue tous les privilèges (dans le cas d'un superutilisateur uniquement):
    GRANT ALL ON *.* TO 'nom_user'@'localhost' WITH GRANT OPTION;
7. le nouveau superutilisateur est créé et on peut utiliser les infos de connexion user et password dans le "conn"

In [3]:
# on crée un curseur en utilisant le connexion object créé ci-dessus
cursor = conn.cursor()

In [4]:
# on crée une bdd nommée testdb2
cursor.execute("CREATE DATABASE IF NOT EXISTS testdb2;")

1

In [5]:
cursor.execute("CREATE DATABASE IF NOT EXISTS testdb;")

1

In [6]:
# si on utilise SHOW DATABASES, on obtient le nombre de bdd existantes dans le curseur mais pas de liste de bdd
cursor.execute("SHOW DATABASES;")

11

In [7]:
# pour obtenir une liste de bdd, il faut utiliser ensuite, une commande "fetch"
# il existe 3 types de commandes fetch :
# - cursor.fetchone() pour renvoyer un seul résultat
# - cursor.fetchmany(10) pour renvoyer, ici, 10 résultats
# - cursor.fetchall() pour renvoyer tous les résultats
# on peut aussi utiliser list(cursor) pour récupérer tout ce qu'il y a dans le curseur

# ici on va utiliser fetchall pour voir toutes les bdd
cursor.fetchall()

(('foodly',),
 ('foodly2',),
 ('information_schema',),
 ('moviz',),
 ('moviz2',),
 ('mysql',),
 ('performance_schema',),
 ('school',),
 ('sys',),
 ('testdb',),
 ('testdb2',))

In [8]:
# on supprime la bdd testdb2 avec DROP DATABASE

cursor.execute("DROP DATABASE testdb2;")

0

In [9]:
cursor.execute("SHOW DATABASES;")
cursor.fetchall()

(('foodly',),
 ('foodly2',),
 ('information_schema',),
 ('moviz',),
 ('moviz2',),
 ('mysql',),
 ('performance_schema',),
 ('school',),
 ('sys',),
 ('testdb',))

In [10]:
# on choisit la bdd à utiliser
cursor.execute("USE testdb;")

0

In [11]:
# on crée la table person en utilisant une variable person_table et ''' ''' pour que ce soit plus lisible
person_table = '''CREATE TABLE IF NOT EXISTS person (
person_id MEDIUMINT UNSIGNED,
first_name VARCHAR(50),
last_name VARCHAR(50),
age TINYINT UNSIGNED,
marital_status TINYINT(1),
country VARCHAR(75),
PRIMARY KEY(person_id)
);'''

# on exécute la requête person_table
cursor.execute(person_table)

0

In [12]:
# pour vérifier les colonnes de la table on utilise la commande DESC (=describe) puis fetchall pour afficher
cursor.execute("DESC person;")
cursor.fetchall()

(('person_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('last_name', 'varchar(50)', 'YES', '', None, ''),
 ('age', 'tinyint unsigned', 'YES', '', None, ''),
 ('marital_status', 'tinyint(1)', 'YES', '', None, ''),
 ('country', 'varchar(75)', 'YES', '', None, ''))

In [13]:
# on va insérer une ligne dans notre bdd person
# on crée une variable avec la requête :
one_row = '''INSERT INTO person (
person_id, first_name, last_name, age, marital_status, country)
VALUES(6, "Betty", "Doe", 21, 1, "United States");'''

# ATTENTION : si on insère bien une valeur dans chaque colonne et dans l'ordre, on n'est pas obligés de donner
# les noms des colonnes.
# on peut simplement faire INSERT INTO person VALUES(1, "John", "smith", 23, 0, "United States");

# on exécute la requête :
cursor.execute(one_row)

1

In [14]:
# si on veut insérer plusieurs entrées :
mult_rows = '''INSERT INTO person
VALUES(2, 'Mark', 'Adams', 53, 1, 'France'),
      (3, 'Jack', 'Perry', 18, 0, 'England');'''

cursor.execute(mult_rows)

2

In [15]:
# cursor.execute("SELECT * FROM person;")

In [20]:
# update table : changement de données déjà existantes
cursor.execute("UPDATE person SET marital_status = 0 WHERE person_id = 5;")

1

In [21]:
cursor.execute("UPDATE person SET country = 'United States' WHERE person_id = 4;")

1

In [22]:
cursor.execute("UPDATE person SET country = 'USA' WHERE country = 'United States';")

1

In [23]:
cursor.execute("UPDATE person SET marital_status = 0, country = 'Italy' WHERE person_id = 4;")

1

In [24]:
requete = "SELECT * FROM person;"
cursor.execute(requete)
cursor.fetchall()

((1, 'John', 'smith', 23, 0, 'USA'),
 (2, 'Mark', 'Adams', 53, 1, 'France'),
 (3, 'Jack', 'Perry', 18, 0, 'England'),
 (4, 'Mary', 'Adams', 53, 0, 'Italy'),
 (5, 'Luke', 'Perry', 18, 0, 'England'),
 (6, 'Betty', 'Doe', 21, 1, 'USA'))

In [45]:
# ALTER TABLE pour ajouter ou supprimer une colonne dans notre bdd

# ajout d'une colonne "race"
cursor.execute("ALTER TABLE person ADD race VARCHAR(75);")
# visualisation de la table :
cursor.execute("DESC person;")
cursor.fetchall()

(('person_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('last_name', 'varchar(50)', 'YES', '', None, ''),
 ('age', 'tinyint unsigned', 'YES', '', None, ''),
 ('marital_status', 'tinyint(1)', 'YES', '', None, ''),
 ('country', 'varchar(75)', 'YES', '', None, ''),
 ('race', 'varchar(75)', 'YES', '', None, ''))

In [46]:
# suppression de la colonne "race":
cursor.execute("ALTER TABLE person DROP race;")
# visualisation de la table :
cursor.execute("DESC person;")
cursor.fetchall()

(('person_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('last_name', 'varchar(50)', 'YES', '', None, ''),
 ('age', 'tinyint unsigned', 'YES', '', None, ''),
 ('marital_status', 'tinyint(1)', 'YES', '', None, ''),
 ('country', 'varchar(75)', 'YES', '', None, ''))

In [49]:
# on peut aussi utiliser ALTER TABLE pour modifier le datatype d'une colonne
# ALTER TABLE table_name MODIFY COLUMN column_name new_data_type(size)
# ATTENTION : le nouveau datatype doit être en conformité avec les données déjà entrées
# la conversion des données doit être possible pour éviter des erreurs

# on peut aussi utiliser la même syntaxe pour juste changer la taille du champs
cursor.execute("ALTER TABLE person MODIFY COLUMN last_name VARCHAR(75);")
cursor.execute("DESC person;")
cursor.fetchall()

(('person_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('last_name', 'varchar(75)', 'YES', '', None, ''),
 ('age', 'tinyint unsigned', 'YES', '', None, ''),
 ('marital_status', 'tinyint(1)', 'YES', '', None, ''),
 ('country', 'varchar(75)', 'YES', '', None, ''))

In [62]:
# Modifier l'ordre des colonnes :
# on souhaite mettre la colonne marital_status juste après la colonne last_name :
cursor.execute("ALTER TABLE person MODIFY marital_status TINYINT(1) AFTER last_name;")

0

In [63]:
cursor.execute("DESC person;")
cursor.fetchall()

(('person_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('last_name', 'varchar(75)', 'YES', '', None, ''),
 ('marital_status', 'tinyint(1)', 'YES', '', None, ''),
 ('age', 'tinyint unsigned', 'YES', '', None, ''),
 ('country', 'varchar(75)', 'YES', '', None, ''))

In [64]:
# si on veut placer une colonne en toute première position :
# on veut que la colonne last_name soit en première position
cursor.execute("ALTER TABLE person MODIFY last_name VARCHAR(75) FIRST;")
cursor.execute("DESC person;")
cursor.fetchall()

(('last_name', 'varchar(75)', 'YES', '', None, ''),
 ('person_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('marital_status', 'tinyint(1)', 'YES', '', None, ''),
 ('age', 'tinyint unsigned', 'YES', '', None, ''),
 ('country', 'varchar(75)', 'YES', '', None, ''))

In [65]:
# Renommer une table
cursor.execute("ALTER TABLE person RENAME people;")

0

In [67]:
cursor.execute("SHOW TABLES;")
cursor.fetchall()

(('people',),)

In [68]:
# on peut aussi renommer une table en utilisant RENAME TABLE TO:
cursor.execute("RENAME TABLE people TO person;")

0

In [69]:
cursor.execute("SHOW TABLES;")
cursor.fetchall()

(('person',),)

In [35]:
# cursor.execute("DROP DATABASE testdb;")

1

### EXERCICE : créer une bdd school et une table students

In [25]:
cursor.execute("CREATE DATABASE IF NOT EXISTS school;")

1

In [74]:
cursor.execute("USE school;")

0

In [27]:
student_table = '''CREATE TABLE IF NOT EXISTS students(
student_id MEDIUMINT UNSIGNED,
first_name VARCHAR(50),
last_name VARCHAR(50),
address TEXT,
state CHAR(2),
date_of_birth DATE,
phone_number BIGINT,
gender ENUM('male', 'female'),
PRIMARY KEY(student_id)
);'''

In [28]:
cursor.execute(student_table)

0

In [29]:
# vérification des colonnes datatypes de la table
cursor.execute("DESC students;")
cursor.fetchall()

(('student_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('last_name', 'varchar(50)', 'YES', '', None, ''),
 ('address', 'text', 'YES', '', None, ''),
 ('state', 'char(2)', 'YES', '', None, ''),
 ('date_of_birth', 'date', 'YES', '', None, ''),
 ('phone_number', 'bigint', 'YES', '', None, ''),
 ('gender', "enum('male','female')", 'YES', '', None, ''))

In [32]:
# vidage de la table en supprimant toute les données (réinitialisation)
cursor.execute("DELETE FROM students;")

4

In [33]:
# insérer 4 lignes d'étudiants dans la table
mult_students = '''INSERT INTO students VALUES
(1, "Luke", "Perry", '3 avenue of roses', "AL", "1997-09-15", 060503458564, "male"),
(2, "Mary", "Perry", '3 avenue of roses', "AL", "1999-04-21", 060503748974, "female"),
(3, "George", "Kennedy", '45 sunset boulevard avenue', "CA", "1977-02-09", 060868858564, "male"),
(4, "Lucy", "Jameson", '745 5th avenue', "NY", "2000-05-12", 068977034564, "female");
'''
cursor.execute(mult_students)

4

In [34]:
cursor.execute("SHOW DATABASES;")
cursor.fetchall()

(('foodly',),
 ('foodly2',),
 ('information_schema',),
 ('moviz',),
 ('moviz2',),
 ('mysql',),
 ('performance_schema',),
 ('school',),
 ('sys',),
 ('testdb',))

In [35]:
# cursor.execute("DROP TABLE students;")

In [36]:
update_student = "UPDATE students SET address = '40 sunset boulevard avenue', state = 'NY' WHERE student_id = 3;"
cursor.execute(update_student)

1

In [37]:
requete = "SELECT * FROM students;"
cursor.execute(requete)
cursor.fetchall()

((1,
  'Luke',
  'Perry',
  '3 avenue of roses',
  'AL',
  datetime.date(1997, 9, 15),
  60503458564,
  'male'),
 (2,
  'Mary',
  'Perry',
  '3 avenue of roses',
  'AL',
  datetime.date(1999, 4, 21),
  60503748974,
  'female'),
 (3,
  'George',
  'Kennedy',
  '40 sunset boulevard avenue',
  'NY',
  datetime.date(1977, 2, 9),
  60868858564,
  'male'),
 (4,
  'Lucy',
  'Jameson',
  '745 5th avenue',
  'NY',
  datetime.date(2000, 5, 12),
  68977034564,
  'female'))

In [59]:
# Pour modifier une table (ajouter ou supprimer une colonne) on utilise la commande ALTER TABLE
cursor.execute("ALTER TABLE students ADD email_address CHAR;")
cursor.execute("DESC students;")
cursor.fetchall()

(('student_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('last_name', 'varchar(50)', 'YES', '', None, ''),
 ('address', 'text', 'YES', '', None, ''),
 ('state', 'char(2)', 'YES', '', None, ''),
 ('date_of_birth', 'date', 'YES', '', None, ''),
 ('phone_number', 'bigint', 'YES', '', None, ''),
 ('gender', "enum('male','female')", 'YES', '', None, ''),
 ('email_address', 'char(1)', 'YES', '', None, ''))

In [60]:
# modifier le datatype de la colonne email_address de CHAR à VARCHAR(75)
cursor.execute("ALTER TABLE students MODIFY COLUMN email_address VARCHAR(75);")
cursor.execute("DESC students;")
cursor.fetchall()

(('student_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('last_name', 'varchar(50)', 'YES', '', None, ''),
 ('address', 'text', 'YES', '', None, ''),
 ('state', 'char(2)', 'YES', '', None, ''),
 ('date_of_birth', 'date', 'YES', '', None, ''),
 ('phone_number', 'bigint', 'YES', '', None, ''),
 ('gender', "enum('male','female')", 'YES', '', None, ''),
 ('email_address', 'varchar(75)', 'YES', '', None, ''))

In [71]:
# mettre la colonne email_address en première position
cursor.execute("ALTER TABLE students MODIFY email_address VARCHAR(75) FIRST;")
cursor.execute("DESC students;")
cursor.fetchall()

(('email_address', 'varchar(75)', 'YES', '', None, ''),
 ('student_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('last_name', 'varchar(50)', 'YES', '', None, ''),
 ('address', 'text', 'YES', '', None, ''),
 ('state', 'char(2)', 'YES', '', None, ''),
 ('date_of_birth', 'date', 'YES', '', None, ''),
 ('phone_number', 'bigint', 'YES', '', None, ''),
 ('gender', "enum('male','female')", 'YES', '', None, ''))

In [73]:
# mettre la colonne date_of_birth après la colonne last_name
cursor.execute("ALTER TABLE students MODIFY date_of_birth DATE AFTER last_name;")
cursor.execute("DESC students;")
cursor.fetchall()

(('email_address', 'varchar(75)', 'YES', '', None, ''),
 ('student_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('last_name', 'varchar(50)', 'YES', '', None, ''),
 ('date_of_birth', 'date', 'YES', '', None, ''),
 ('state', 'char(2)', 'YES', '', None, ''),
 ('address', 'text', 'YES', '', None, ''),
 ('phone_number', 'bigint', 'YES', '', None, ''),
 ('gender', "enum('male','female')", 'YES', '', None, ''))

In [75]:
# renommage de la colonne email_address en email
cursor.execute("ALTER TABLE students RENAME COLUMN email_address TO email;")

0

In [76]:
cursor.execute("DESC students;")
cursor.fetchall()

(('email', 'varchar(75)', 'YES', '', None, ''),
 ('student_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('last_name', 'varchar(50)', 'YES', '', None, ''),
 ('date_of_birth', 'date', 'YES', '', None, ''),
 ('state', 'char(2)', 'YES', '', None, ''),
 ('address', 'text', 'YES', '', None, ''),
 ('phone_number', 'bigint', 'YES', '', None, ''),
 ('gender', "enum('male','female')", 'YES', '', None, ''))

In [77]:
# suppression de la colonne email
cursor.execute("ALTER TABLE students DROP email;")

0

In [78]:
cursor.execute("DESC students;")
cursor.fetchall()

(('student_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('last_name', 'varchar(50)', 'YES', '', None, ''),
 ('date_of_birth', 'date', 'YES', '', None, ''),
 ('state', 'char(2)', 'YES', '', None, ''),
 ('address', 'text', 'YES', '', None, ''),
 ('phone_number', 'bigint', 'YES', '', None, ''),
 ('gender', "enum('male','female')", 'YES', '', None, ''))

**FIN DE L'EXERCICE**

### Constraints

In [19]:
# création d'une nouvelle table country_table dans la bdd test:
country_table = '''CREATE TABLE IF NOT EXISTS country(
country_id MEDIUMINT UNSIGNED AUTO_INCREMENT,
country_name VARCHAR(75),
PRIMARY KEY(country_id)
);'''

cursor.execute(country_table)

cursor.execute("DESC country;")
cursor.fetchall()

# ici on n'a désigné qu'une seule colonne en tant que PK (country_id). Si on avait voulu désigner plusieurs
# colonnes dans la primary key, on aurait fait : PRIMARY KEY(col_id1, col_id2, col_id3)

(('country_id', 'mediumint unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('country_name', 'varchar(75)', 'YES', '', None, ''))

In [15]:
# si on veut modifier la table précédente afin que les country_id en AUTO_INCREMENT ne commence qu'à partir de 100 :
cursor.execute("ALTER TABLE country AUTO_INCREMENT = 100;")

0

In [ ]:
# on peut aussi ajouter une primary key à une table existante:
# 1) on supprime la PK existante :
# cursor.execute("ALTER TABLE person DROP PRIMARY KEY;")
# 2) on crée la nouvelle OPK :
# cursor.execute("ALTER TABLE person ADD PRIMARY KEY(person_id);")

In [20]:
grades_table = '''CREATE TABLE grades(
grade_id INT UNSIGNED AUTO_INCREMENT,
student_id MEDIUMINT UNSIGNED,
course_id TINYINT UNSIGNED,
grades TINYINT UNSIGNED,
PRIMARY KEY(grade_id)
)'''

cursor.execute(grades_table)

0

In [22]:
cursor.execute("DESC grades;")
cursor.fetchall()

(('grade_id', 'int unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('student_id', 'mediumint unsigned', 'YES', '', None, ''),
 ('course_id', 'tinyint unsigned', 'YES', '', None, ''),
 ('grades', 'tinyint unsigned', 'YES', '', None, ''))

In [18]:
# ATTENTION ! Toujours penser à fermer la connexion pour des questions de sécurité et de performances du serveur

conn.close()